# Посчитать коэффициент линейной регрессии при заработной плате (zp),
# используя градиентный спуск (без intercept).

import numpy as np

x = np.array([35, 45, 190, 200, 40, 70, 54, 150, 120, 110])
y = np.array([401, 574, 874, 919, 459, 739, 653, 902, 746, 832])

alpha = 0.000001
b1 = 0.1
n = len(x)

for i in range(100000):
    b1 -= alpha * (2/n) * np.sum((b1 * x - y) * x)
    if i % 10000 == 0:
        print ('B1 = {}'.format(b1))
# B1 = 0.25952808
# B1 = 5.889820420132673
# B1 = 5.889820420132673
# B1 = 5.889820420132673
# B1 = 5.889820420132673
# B1 = 5.889820420132673
# B1 = 5.889820420132673
# B1 = 5.889820420132673
# B1 = 5.889820420132673
# B1 = 5.889820420132673